Tekla Open API Reference for Tekla Structures 2025
MainWindow Fields
The MainWindow type exposes the following members.
Fields
Name | Description
Frame
 The main Tekla Structures window.
Top
See Also
Reference
MainWindow Class
Tekla.Structures.Dialog Namespace